tap "d12frosted/emacs-plus"

brew "eza"
brew "powerlevel10k"
brew "zoxide"
brew "direnv"
brew "carapace"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "lazygit"
brew "zsh-history-substring-search"
brew "pass"
brew "zsh-autosuggestions"
brew "git"
brew "awscli"
brew "gh"
brew "bat"
brew "bat-extras"
brew "bottom"

cask "ghostty"
cask "leader-key"
cask "rectangle"
cask "emacs-plus-app"
cask "resilio-sync"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

cargo "emacs-lsp-booster"
